
const config = {
    FILL_OUT_FIELDS_WARNING: "Моля, попълнете всички полета!",
    LOGIN_ERROR: "Грешка при вход: ",
    NOT_LOGGED_IN_WARNING: "Не сте влезли в системата!",
    PASSWORDS_DO_NOT_MATCH: "Паролите не съвпадат!",
    INVALID_EMAIL_WARNING: "Моля, въведете валиден имейл адрес!",
    REGISTRATION_SUCCESS: "Регистрацията е успешна! Добре дошли!",
    REGISTRATION_ERROR: "Грешка при регистрация: ",
    ADD_LOCATION_SUCCESS: "Локацията е добавена успешно!",
    ADD_LOCATION_ERROR: "Възникна грешка. Опитайте отново.",
    ACCESS_DENIED: "Достъпът е отказан. Само регистрирани потребители могат да добавят локации.",
    EDIT_ITEM_SUCCESS: "Предметът беше успешно редактиран!",
    ITEM_NOT_FOUND: "Предметът не беше намерен!",
    NO_PERMISSION_TO_EDIT: "Нямате право да редактирате този предмет!",
    ADD_SPELL_SUCCESS: "Магията е добавена успешно!",
    ACCESS_DENIED_SPELLBOOK: "🔒 Трябва да сте регистриран потребител, за да добавяте магии.",
    // can add more later if needed
};

export default config;
